app/views/posts/index.html.erb

SELECT "authors".* FROM "authors"
---
  <%= form_tag("/posts", method: "get") do %>
    <%= select_tag "author", options_from_collection_for_select(Author.all, "id", "name"), include_blank: true %>

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
---
<% if !params[:author].blank? %>
  <% @posts = Post.where(author: params[:author]) %>